TWO_fimi_client/Debug/POSRequestRq_C2A_WM_Cards.xml

<soap:Envelope
    xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    xmlns:fimi="http://schemas.compassplus.com/two/1.0/fimi.xsd"
    xmlns:fimi1="http://schemas.compassplus.com/two/1.0/fimi_types.xsd">
    <soap:Header/>
    <soap:Body>
        <fimi:POSRequestRq>
            <fimi:Request>
                <!--Mandatory:-->
                <fimi1:TranType>200</fimi1:TranType>
                <fimi1:TranCode>132</fimi1:TranCode>
		<fimi1:CardUID>CC091D7220D8A7F7E053162F10ACEB67</fimi1:CardUID>
        	<fimi1:Amount>1000</fimi1:Amount>
        	<fimi1:Currency>810</fimi1:Currency>                
		<fimi1:FromAcctType>1</fimi1:FromAcctType>
        	<fimi1:Condition>0</fimi1:Condition>
        	<fimi1:EntryMode>012</fimi1:EntryMode>		
        	<fimi1:Invoice>7777</fimi1:Invoice>
                <!--<fimi1:TranNumber>2</fimi1:TranNumber>-->
                <!--Optional:-->
                <!--<fimi1:Fee>10</fimi1:Fee>-->
                <fimi1:MessageToRecipient>Пополнение кошелька R123 c карты *7890</fimi1:MessageToRecipient><!--Optional:-->		
            </fimi:Request>
        </fimi:POSRequestRq>
    </soap:Body>
</soap:Envelope>